app/Models/ModelLokasi.php

    public function insertData($data)
    {
        return $this->insert($data);
---
INSERT INTO `tbl_lokasi` (`nama_lokasi`, `alamat_lokasi`, `fasilitas`, `aksesibilitas`, `transportasi`, `nomor_tlp_bkm`, `luas_lahan`, `luas_parkir`, `area_wudhu`, `kapasitas`, `latitude`, `longitude`, `foto_lokasi`) VALUES ('Masjid Jami Al-Ridha', 'Jl. Lintas Sumatra No.119, Lima Puluh Kota, Kec. Lima Puluh, Kabupaten Batu Bara, Sumatera Utara 21255', 'AC, Kipas Angin, Tempat Wudhu, Halaman Parkir, Ruang Istirahat, Ruang Darurat', 'Kursi Roda, Tongkat, Kursi Sholat, mukena bagi wanita.', 'stasiun KAI, ojol, angkutan umum, betor, bus', '081368698698', '1100 x 800', '50 x 50', '20 x 15', '4000', '3.1688293826962797', '99.4181211151346', '1727325426_b952106717633df42e98.jpg')

    public function getAllData()
    {
        return $this->db->table('tbl_lokasi')
        ->get()->getResultArray();
---
SELECT *
FROM `tbl_lokasi`

    public function getDataById($id_lokasi)
    {
        return $this->db->table('tbl_lokasi')
        ->where('id_lokasi', $id_lokasi)
        ->get()->getRowArray();
---
SELECT *
FROM `tbl_lokasi`
WHERE `id_lokasi` = '5'